kochaika/esp32-c6-thread-button/sdkconfig.defaults.esp32c6
CONFIG_IDF_TARGET="esp32c6"

# Device identification (test vendor ID works with Apple/Google Home)
CONFIG_DEVICE_VENDOR_ID=0xFFF1
CONFIG_DEVICE_PRODUCT_ID=0x8001

# libsodium
CONFIG_LIBSODIUM_USE_MBEDTLS_SHA=y

# NIMBLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_EXT_ADV=n
CONFIG_BT_NIMBLE_HCI_EVT_BUF_SIZE=70
CONFIG_BT_LE_SLEEP_ENABLE=y
CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING=y
CONFIG_ESP_PHY_MAC_BB_PD=y

# Power Management
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y
CONFIG_PM_POWER_DOWN_PERIPHERAL_IN_LIGHT_SLEEP=y

# FreeRTOS should use legacy API
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# Enable OpenThread
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_DNS_CLIENT=y
CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC=n
CONFIG_OPENTHREAD_LOG_LEVEL_NOTE=y
CONFIG_OPENTHREAD_MTD=y
CONFIG_OPENTHREAD_CLI=n

# IEEE802.15.4
CONFIG_IEEE802154_SLEEP_ENABLE=y

# Disable lwip ipv6 autoconfig
CONFIG_LWIP_IPV6_AUTOCONFIG=n

# Use a custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# LwIP config for OpenThread
CONFIG_LWIP_ND6=n
CONFIG_LWIP_IPV4=n
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8
CONFIG_LWIP_MULTICAST_PING=y

# MDNS platform
CONFIG_USE_MINIMAL_MDNS=n
CONFIG_ENABLE_EXTENDED_DISCOVERY=y

# Enable OTA Requestor
CONFIG_ENABLE_OTA_REQUESTOR=y

# IPv6-only Matter over Thread
CONFIG_DISABLE_IPV4=y

# MbedTLS
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y

# ICD Server, LIT profile
CONFIG_ENABLE_ICD_SERVER=y
CONFIG_ICD_SLOW_POLL_INTERVAL_MS=20000
CONFIG_ICD_FAST_POLL_INTERVAL_MS=500
CONFIG_ICD_IDLE_MODE_INTERVAL_SEC=600
CONFIG_ICD_ACTIVE_MODE_INTERVAL_MS=1000
CONFIG_ICD_ACTIVE_MODE_THRESHOLD_MS=5000
CONFIG_ENABLE_ICD_LIT=y
CONFIG_ICD_CLIENTS_SUPPORTED_PER_FABRIC=2
CONFIG_ICD_MAX_NOTIFICATION_SUBSCRIBERS=2
CONFIG_SUPPORT_ICD_MANAGEMENT_CLUSTER=y

# Build Matter OTA image (creates .ota file alongside .bin)
# CONFIG_CHIP_OTA_IMAGE_BUILD=y

# Disable STA and AP for ESP32C6
CONFIG_ENABLE_WIFI_STATION=n
CONFIG_ENABLE_WIFI_AP=n

# Button
CONFIG_BUTTON_PERIOD_TIME_MS=20
CONFIG_BUTTON_LONG_PRESS_TIME_MS=1000
CONFIG_BUTTON_GPIO=0
CONFIG_GPIO_BUTTON_SUPPORT_POWER_SAVE=y

# Enable chip shell
CONFIG_ENABLE_CHIP_SHELL=n

#CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
#CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=y
#CONFIG_ESP_CONSOLE_UART_NUM=-1
#CONFIG_ESP_CONSOLE_ROM_SERIAL_PORT_NUM=3
#CONFIG_OPENTHREAD_CONSOLE_TYPE_USB_SERIAL_JTAG=y
#CONFIG_CONSOLE_UART_NUM=-1

# Exclude unused clusters to optimize flash and memory usage
# Note: COLOR_CONTROL must remain enabled as level-control depends on it
# CONFIG_SUPPORT_COLOR_CONTROL_CLUSTER=n
